{
    "countries": [
      {
        "name": "Bangladesh",
        "touristSpots": [
          {
            "title": "Sundarban",
            "description": "The Sundarbans mangrove forest, one of the largest of its kind in the world, is a UNESCO World Heritage Site and home to the Royal Bengal tiger. It covers an area of about 10,000 square kilometers across India and Bangladesh and is a critical habitat for numerous species of flora and fauna.",
            "image": "sundarban.jpg",
            "total_visitor": 1000000,
            "living_cost": "$30/day",
            "booking_price": "$100/person"
          },
          {
            "title": "Cox’s Bazar",
            "description": "Cox's Bazar is famous for its long sandy beach and is a popular destination for tourists seeking sun, sea, and relaxation. Stretching over 120 kilometers, it is one of the longest natural sea beaches in the world. The beach town offers activities such as beach walks, water sports, and visits to nearby attractions like Himchari National Park.",
            "image": "coxs_bazar.jpg",
            "total_visitor": 1500000,
            "living_cost": "$40/day",
            "booking_price": "$150/person"
          },
          {
            "title": "Rangamati",
            "description": "Rangamati is known for its picturesque landscapes, indigenous communities, and the beautiful Kaptai Lake. The hill town is a perfect retreat for nature lovers, offering opportunities for boating on the lake, exploring tribal culture, and hiking in the surrounding hills.",
            "image": "rangamati.jpg",
            "total_visitor": 500000,
            "living_cost": "$35/day",
            "booking_price": "$120/person"
          },
          {
            "title": "Bandarban",
            "description": "Bandarban offers stunning hill landscapes, tribal culture, and opportunities for trekking and adventure. It is home to Bangladesh's highest peak, Tahjindong, and attractions like Nilgiri Hills, Boga Lake, and the tribal villages of the indigenous communities.",
            "image": "bandarban.jpg",
            "total_visitor": 300000,
            "living_cost": "$30/day",
            "booking_price": "$110/person"
          },
          {
            "title": "Saint Martin’s Island",
            "description": "Saint Martin’s Island is known for its pristine beaches, clear blue waters, and coral reefs, making it a paradise for snorkelers and divers. The island offers a laid-back atmosphere, with activities such as snorkeling, beachcombing, and enjoying fresh seafood at local eateries.",
            "image": "saint_martin.jpg",
            "total_visitor": 200000,
            "living_cost": "$50/day",
            "booking_price": "$200/person"
          }
        ]
      },
      {
        "name": "Thailand",
        "touristSpots": [
          {
            "title": "Bangkok",
            "description": "Bangkok is a vibrant city known for its temples, street food, nightlife, and shopping experiences. Visitors can explore attractions like the Grand Palace, Wat Pho, Chatuchak Market, and enjoy boat rides along the Chao Phraya River.",
            "image": "bangkok.jpg",
            "total_visitor": 3000000,
            "living_cost": "$50/day",
            "booking_price": "$200/person"
          },
          {
            "title": "Chiang Mai",
            "description": "Chiang Mai is famous for its ancient temples, cultural festivals, and opportunities for trekking in the nearby mountains. Visitors can explore historic sites such as Wat Phra That Doi Suthep, participate in the Yi Peng Lantern Festival, and enjoy the vibrant night markets.",
            "image": "chiang_mai.jpg",
            "total_visitor": 1200000,
            "living_cost": "$40/day",
            "booking_price": "$150/person"
          },
          {
            "title": "Ayutthaya",
            "description": "Ayutthaya is a UNESCO World Heritage Site known for its ancient ruins and historical significance as the former capital of Thailand. Visitors can explore temple complexes like Wat Phra Si Sanphet, Wat Mahathat, and Wat Chaiwatthanaram, showcasing Thailand's rich cultural heritage.",
            "image": "ayutthaya.jpg",
            "total_visitor": 800000,
            "living_cost": "$35/day",
            "booking_price": "$130/person"
          },
          {
            "title": "Phuket",
            "description": "Phuket is a popular beach destination known for its nightlife, water sports, and scenic beauty. Visitors can relax on beaches like Patong Beach, explore Phi Phi Islands on day trips, and enjoy activities such as snorkeling, diving, and island-hopping.",
            "image": "phuket.jpg",
            "total_visitor": 2500000,
            "living_cost": "$60/day",
            "booking_price": "$250/person"
          },
          {
            "title": "Phi Phi Islands",
            "description": "The Phi Phi Islands are famous for their crystal-clear waters, white sandy beaches, and excellent diving and snorkeling spots. Visitors can explore Maya Bay, enjoy water activities like snorkeling and kayaking, and experience the vibrant nightlife on Phi Phi Don.",
            "image": "phi_phi_islands.jpg",
            "total_visitor": 1000000,
            "living_cost": "$70/day",
            "booking_price": "$300/person"
          }
        ]
      },
      {
        "name": "Indonesia",
        "touristSpots": [
          {
            "title": "Bali",
            "description": "Bali, known as the 'Island of the Gods,' is a paradise of stunning beaches, lush rice terraces, and vibrant culture. Visitors can explore ancient temples like Tanah Lot and Uluwatu, enjoy water sports in Nusa Dua, or experience the artistic and spiritual atmosphere of Ubud.",
            "image": "bali.jpg",
            "total_visitor": 4000000,
            "living_cost": "$60/day",
            "booking_price": "$250/person"
          },
          {
            "title": "Borobudur Temple",
            "description": "Borobudur Temple, a UNESCO World Heritage Site, is one of the most impressive Buddhist monuments in the world. Located near Yogyakarta, this ancient temple complex showcases intricate carvings and stupas, offering a glimpse into Indonesia's rich cultural and religious history.",
            "image": "borobudur_temple.jpg",
            "total_visitor": 1000000,
            "living_cost": "$40/day",
            "booking_price": "$150/person"
          },
          {
            "title": "Komodo National Park",
            "description": "Komodo National Park is a haven for nature enthusiasts, home to the iconic Komodo dragons. Apart from these legendary creatures, the park's marine ecosystem is teeming with colorful coral reefs, manta rays, and diverse marine life, making it a paradise for diving and snorkeling.",
            "image": "komodo_national_park.jpg",
            "total_visitor": 500000,
            "living_cost": "$50/day",
            "booking_price": "$200/person"
          },
          {
            "title": "Raja Ampat Islands",
            "description": "The Raja Ampat Islands offer unparalleled natural beauty, with crystal-clear waters, lush forests, and incredible marine biodiversity. Divers and snorkelers can explore vibrant coral reefs, while adventurers can trek through pristine rainforests and discover hidden waterfalls.",
            "image": "raja_ampat_islands.jpg",
            "total_visitor": 300000,
            "living_cost": "$70/day",
            "booking_price": "$300/person"
          },
          {
            "title": "Yogyakarta",
            "description": "Yogyakarta, often called Jogja, is a cultural hub known for its traditional arts, historic sites, and lively street scenes. Visitors can explore the Sultan's Palace (Kraton), witness ancient temples like Prambanan and Borobudur, shop for handicrafts in Malioboro, and savor local Javanese cuisine.",
            "image": "yogyakarta.jpg",
            "total_visitor": 2000000,
            "living_cost": "$45/day",
            "booking_price": "$180/person"
          }
        ]
      },
      {
        "name": "Malaysia",
        "touristSpots": [
          {
            "title": "Kuala Lumpur",
            "description": "Kuala Lumpur, the capital city of Malaysia, is a vibrant metropolis known for its modern skyscrapers, bustling street markets, and rich cultural heritage. Visitors can explore iconic landmarks like the Petronas Twin Towers, visit the historic Merdeka Square, experience the lively atmosphere of Bukit Bintang, and sample a variety of delicious Malaysian cuisine.",
            "image": "kuala_lumpur.jpg",
            "total_visitor": 2000000,
            "living_cost": "$60/day",
            "booking_price": "$250/person"
          },
          {
            "title": "Langkawi",
            "description": "Langkawi is a stunning archipelago consisting of 99 islands in the Andaman Sea. Known for its pristine beaches, clear turquoise waters, and lush rainforests, Langkawi offers a perfect blend of relaxation and adventure. Visitors can enjoy water sports such as snorkeling, diving, and jet skiing, explore the Langkawi Sky Bridge, visit the Kilim Karst Geoforest Park, and indulge in duty-free shopping.",
            "image": "langkawi.jpg",
            "total_visitor": 1500000,
            "living_cost": "$70/day",
            "booking_price": "$300/person"
          },
          {
            "title": "Penang",
            "description": "Penang is a captivating island known for its diverse culture, heritage buildings, and mouthwatering street food. George Town, the capital of Penang, is a UNESCO World Heritage Site with charming colonial architecture, vibrant street art, and bustling markets. Visitors can explore historic sites such as Fort Cornwallis and Khoo Kongsi, visit the Penang Hill for panoramic views, and savor local delicacies like Char Kway Teow and Penang Laksa.",
            "image": "penang.jpg",
            "total_visitor": 1000000,
            "living_cost": "$50/day",
            "booking_price": "$200/person"
          },
          {
            "title": "Cameron Highlands",
            "description": "Cameron Highlands is a cool and refreshing hill station known for its tea plantations, strawberry farms, and lush landscapes. Visitors can take scenic drives through rolling hills, visit tea estates like Boh Tea Plantation, explore the Mossy Forest for unique flora and fauna, and enjoy outdoor activities such as hiking and bird-watching.",
            "image": "cameron_highlands.jpg",
            "total_visitor": 800000,
            "living_cost": "$55/day",
            "booking_price": "$220/person"
          },
          {
            "title": "Taman Negara National Park",
            "description": "Taman Negara is Malaysia's oldest national park and is home to one of the world's oldest rainforests. Visitors can experience the beauty of untouched nature through activities like jungle trekking, canopy walks, night safaris to spot wildlife such as tigers and elephants, and river cruises along the Tembeling River. The park also offers opportunities for camping, fishing, and exploring ancient caves.",
            "image": "taman_negara.jpg",
            "total_visitor": 600000,
            "living_cost": "$65/day",
            "booking_price": "$270/person"
          }
        ]
      },
      {
        "name": "Vietnam",
        "touristSpots": [
          {
            "title": "Ha Long Bay",
            "description": "Ha Long Bay, located in Quang Ninh Province, is a UNESCO World Heritage Site and one of Vietnam's most iconic natural wonders. It features emerald waters dotted with thousands of limestone islands and islets, each topped with lush vegetation. Visitors can take boat cruises to explore the bay, visit fishing villages, and marvel at the unique karst formations. Ha Long Bay offers breathtaking sunsets and is a paradise for photographers and nature enthusiasts alike.",
            "image": "ha_long_bay.jpg",
            "total_visitor": 2000000,
            "living_cost": "$40/day",
            "booking_price": "$150/person"
          },
          {
            "title": "Ho Chi Minh City",
            "description": "Ho Chi Minh City, formerly known as Saigon, is the largest city in Vietnam and a bustling hub of culture, history, and commerce. It is renowned for its French colonial architecture, vibrant street markets like Ben Thanh Market, and historic landmarks such as the Reunification Palace and Notre Dame Cathedral Basilica of Saigon. Visitors can explore the city's museums, enjoy traditional Vietnamese cuisine, and experience the energetic nightlife.",
            "image": "ho_chi_minh_city.jpg",
            "total_visitor": 2500000,
            "living_cost": "$50/day",
            "booking_price": "$180/person"
          },
          {
            "title": "Hoi An Ancient Town",
            "description": "Hoi An Ancient Town, situated in Quang Nam Province, is a UNESCO World Heritage Site known for its exceptionally well-preserved architecture, reflecting a blend of Vietnamese, Chinese, and Japanese influences. The town is famous for its lantern-lit streets, charming riverside views, and traditional wooden houses. Visitors can explore ancient temples, enjoy boat rides along the Thu Bon River, and shop for handicrafts and tailor-made clothing.",
            "image": "hoi_an.jpg",
            "total_visitor": 1500000,
            "living_cost": "$45/day",
            "booking_price": "$160/person"
          },
          {
            "title": "Phong Nha Caves",
            "description": "Phong Nha-Ke Bang National Park, located in Quang Binh Province, is a UNESCO World Heritage Site renowned for its spectacular cave systems. The park is home to some of the world's most stunning caves, including Son Doong, the largest cave chamber by volume. Visitors can explore underground rivers, magnificent stalactites and stalagmites, and diverse ecosystems. Phong Nha Caves offer unforgettable adventures for spelunkers and nature enthusiasts.",
            "image": "phong_nha_caves.jpg",
            "total_visitor": 800000,
            "living_cost": "$35/day",
            "booking_price": "$140/person"
          },
          {
            "title": "Mekong Delta",
            "description": "The Mekong Delta, often referred to as the 'Rice Bowl' of Vietnam, is a vast region in southern Vietnam known for its fertile lands, winding rivers, and vibrant floating markets. The delta is a vital agricultural area, producing rice, fruits, and vegetables. Visitors can take boat tours along the Mekong River, visit traditional villages, sample local cuisine, and witness the unique way of life in this water-rich region.",
            "image": "mekong_delta.jpg",
            "total_visitor": 1200000,
            "living_cost": "$50/day",
            "booking_price": "$200/person"
          }
        ]
      },
      {
        "name": "Cambodia",
        "touristSpots": [
          {
            "title": "Angkor Wat",
            "description": "Angkor Wat is a UNESCO World Heritage Site and one of the largest religious monuments in the world. Built in the 12th century by King Suryavarman II, it represents the pinnacle of Khmer architecture and is dedicated to the Hindu god Vishnu. The temple complex spans over 400 acres and includes intricate carvings, bas-reliefs, and the iconic central tower. Visitors can explore the various temples, galleries, and courtyards while marveling at the historical and artistic significance of this ancient wonder.",
            "image": "angkor_wat.jpg",
            "total_visitor": 2000000,
            "living_cost": "$40/day",
            "booking_price": "$150/person"
          },
          {
            "title": "Siem Reap",
            "description": "Siem Reap is a charming city located near the Angkor Archaeological Park. Besides being a gateway to Angkor Wat, Siem Reap offers a vibrant mix of culture, history, and modern amenities. Visitors can explore the Old Market with its bustling atmosphere and diverse array of goods, visit traditional Cambodian dance performances, and sample local cuisine at the lively Pub Street. The city also has museums, art galleries, and opportunities for cycling tours to explore the countryside and nearby temples.",
            "image": "siem_reap.jpg",
            "total_visitor": 1500000,
            "living_cost": "$35/day",
            "booking_price": "$120/person"
          },
          {
            "title": "Phnom Penh",
            "description": "Phnom Penh, the capital city of Cambodia, is a vibrant metropolis with a rich history and cultural heritage. Visitors can explore the Royal Palace, home to the King of Cambodia, and the Silver Pagoda with its impressive collection of Buddha statues. The National Museum of Cambodia offers insights into Khmer art and history, while the Tuol Sleng Genocide Museum and Killing Fields provide a sobering look at Cambodia's tragic past. Phnom Penh also has a lively riverfront area, bustling markets, and a growing culinary scene.",
            "image": "phnom_penh.jpg",
            "total_visitor": 1000000,
            "living_cost": "$45/day",
            "booking_price": "$160/person"
          },
          {
            "title": "Kep",
            "description": "Kep is a tranquil coastal town known for its relaxed atmosphere and natural beauty. Visitors can enjoy the scenic beaches, indulge in fresh seafood at the crab market, and explore the Kep National Park with its hiking trails and panoramic views. The town is also famous for its French colonial architecture and abandoned villas, offering a glimpse into its past as a luxurious retreat for the elite. Kep is an ideal destination for those seeking a peaceful seaside getaway away from the crowds.",
            "image": "kep.jpg",
            "total_visitor": 500000,
            "living_cost": "$50/day",
            "booking_price": "$180/person"
          },
          {
            "title": "Bokor National Park",
            "description": "Bokor National Park is a protected area in Cambodia known for its diverse ecosystems and natural beauty. The park encompasses dense forests, waterfalls, and wildlife habitats, making it a haven for nature enthusiasts and adventure seekers. Visitors can explore hiking trails leading to scenic viewpoints, spot wildlife such as gibbons and hornbills, and visit historical sites like the Bokor Hill Station, an abandoned French colonial resort with panoramic views of the surrounding landscapes.",
            "image": "bokor_national_park.jpg",
            "total_visitor": 300000,
            "living_cost": "$55/day",
            "booking_price": "$200/person"
          }
        ]
      }
    ]
  }
  